app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(post_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "top"], ["room_number", 5], ["created_at", "2020-01-14 19:12:35.519615"], ["updated_at", "2020-01-14 19:12:35.519615"]]

    def update
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]